Repository: mfreitas64/team-manager
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: pt

source: 🏀 Team Manager
pt: 🏀 Gestão de Equipas

source: Players
pt: Jogadores

source: Practice Exercises
pt: Exercícios

source: Tournaments
pt: Encontros

source: Practice Register
pt: Registo dos Treinos

source: Sign Up
pt: Criar conta

source: Login
pt: Entrar

source: Logout
pt: Sair

source: Profile
pt: Perfil

source: Home – Team Manager
pt: Home – Gesão de Equipas

source: Player Dashboard
pt: Painel de Jogador

source: Filter by Player
pt: Filtro por Jogador

source: Type a player's name...
pt: Digite o nome do jogador

source: Player
pt: Jogador

source: Time Played (min)
pt: Tempo jogado (min)

source: Practice Time (min)
pt: Tempo de Treino (min)

source: Total Minutes
pt: Total de minutos

source: Player Participation Overview
pt: Participação do jogador

source: Player Participation – Statistics in Minutes
pt: Participação do jogador - Estatistica em minutos

source: Export to CSV
pt: Exportar para CSV

source: Participation by Player
pt: Participação por jogador

source: Player Participation – Statistics in Totals
pt: Participação do jogador - Estatistica em Totais

source: Games Played
pt: Jogos

source: Practices Attended
pt: Treinos - Assiduidade

source: Total Activities
pt: Total de atividades

source: Games and Practices by Player
pt: Jogos e treinos por jogador

source: Edit Player – Team Manager
pt: Editar jogador - Gestão de Equipas

source: Edit Player
pt: Editar jogador

source: Current Season
pt: Época atual

source: Player Name
pt: Nome do jogador

source: Escalão
pt: Level

source: Nº Carteira
pt: Carteira FPB

source: Date of Birth
pt: Data de nascimento

source: Mobile Phone
pt: Telemóvel

source: Save Changes
pt: Guardar

source: Cancel
pt: Cancelar

source: Edit Practice Exercise – Team Manager
pt: Editar exercício - Gestão de Equipas

source: Edit Practice Exercise
pt: Editar Exercício

source: Category
pt: Categoria

source: Needed Material
pt: Material

source: Execution Description
pt: Execução

source: Image
pt: Imagem

source: Back
pt: Voltar

source: Edit Practice Register – Team Manager
pt: Editar treino - Gestão de Equipas

source: Edit Practice Register
pt: Editar treino

source: Practice Date
pt: Data do treino

source: Duration (minutes)
pt: Duração

source: Players Present
pt: Jogadores Presentes

source: Exercises Used
pt: Exercícios usados

source: Coach Notes
pt: Notas

source: Edit Tournament – Team Manager
pt: Editar Encontro - Gestão de Equipas

source: Edit Tournament
pt: Editar Encontros

source: Date
pt: Data

source: Place
pt: Local

source: Team Name
pt: Nome da Equipa

source: Opponent
pt: Adversário

source: Select Players
pt: Selecione jogadores

source: Welcome to Your Team Manager
pt: Bem-vindo à sua Gestão de Equipas

source: Your all-in-one toolkit for managing players, practices, and tournaments
pt: O seu kit de ferramentas completo para gerir épocas, equipas, treinos, encontros

source: Welcome!
pt: Bem-vindo

source: To use this Team Manager system, please
pt: Para aceder à aplicação, por favor

source: sign up
pt: Cria uma

source: for an account.
pt: conta

source: Manage Players
pt: Gestão de jogadores

source: Add new players, view your team roster, and update details.
pt: Adiciona novos jogadores e atualiza os detalhes

source: Go to Players
pt: Ir para Jogadores

source: Record attendance and linked exercises for practices.
pt: Assiduidade de treino e exercícios

source: Go to Practice Register
pt: Ir para os Treinos

source: Log drills and training plans with images and categories.
pt: Registe exercícios e planos de treino com imagens e categorias.

source: Go to Practices
pt: Ir para os Exercícios

source: Plan and track tournaments, players, rotations, and stats.
pt: Planeie e siga encontros, jogadores e estatistica

source: Go to Tournaments
pt: Ir para Encontros

source: Dashboard
pt: Painel

source: View team statistics by minutes or totals.
pt: Ver estatisticas da equipa por minutos ou totais.

source: Statistics in Minutes
pt: Estatisticas em Minutos

source: Statistics in Totals
pt: Estatisticas em Totais

source: Go
pt: Ir

source: Seasons
pt: Épocas

source: Create and manage seasons. Switch between them to isolate your data.
pt: Crie e faça a gestão de épocas. Troque entre elas para isolar os dados

source: Go to Seasons
pt: Ir para Épocas

source: Made with passion by Miguel Freitas
pt: Feito com paixão por: MF

source: Team Manager © 2025
pt: Gestão de Equipas © 2025

source: Login – Team Manager
pt: Entrar - Gestão de Equipas

source: Login to Your Account
pt: Entrar na sua conta

source: Password
pt: Palavra-chave

source: Don't have an account? Sign up
pt: Ainda não tem conta? Crie uma agora!

source: Manage Seasons
pt: Gestão de Épocas

source: Select Active Season:
pt: Selecione a época Ativa

source: Set
pt: Ativa

source: Season Name (e.g. 2024/2025)
pt: Época (e.g. 2024/2025)

source: Year (optional)
pt: Ano (opcional)

source: Add
pt: Adicionar

source: Copy players from current season
pt: Copiar jogadores da época ativa

source: Current
pt: Atual

source: No seasons yet. Add one above.
pt: Sem época ainda. Adicione uma em cima

source: Player History
pt: Historial do jogador

source: Season History
pt: Historial da Época

source: Seasonal Evaluations
pt: Avaliações trimestrais

source: Season
pt: Época

source: Behavior
pt: Comportamento

source: Technical Skills
pt: Capacidades técnicas

source: Team Relation
pt: Relação com a equipa

source: Improvement Areas
pt: Áreas a melhorar

source: Height (cm)
pt: Altura

source: Weight (kg)
pt: Peso

source: Back to Players
pt: Voltar jogadores

source: Participation Summary
pt: Sumário de participação

source: Player Season Stats
pt: Estatistica época do jogador

source: Season Stats
pt: Estatisticas da Época

source: Save Stats
pt: Salvar Stats

source: Team Roster
pt: Capitão

source: Add New Player
pt: Adicionar jogador

source: Season Year
pt: Época Ano

source: Name
pt: Nome

source: Add Player
pt: Adicionar jogador

source: DOB
pt: Data de nascimento

source: Phone
pt: Telemóvel

source: Actions
pt: Ações

source: Edit
pt: Editar

source: Are you sure you want to delete this player?
pt: Tem a certeza que quer apagar este jogador?

source: Delete
pt: Apagar

source: History
pt: Histórico

source: Add Practice Exercise
pt: Adicionar Exercício

source: URL or path
pt: URL ou caminho

source: Add Exercise
pt: Adicionar Exercício

source: All Exercises
pt: Todos os exercícios

source: Exercise Image
pt: Imagem de exercício

source: Delete this exercise?
pt: Apagar este exercício

source: Created
pt: Criado

source: Add Practice Register
pt: Adicionar Treino

source: Save Register
pt: Salvar treino

source: Show practices from:
pt: Mostrar treinos desde:

source: Filter
pt: Filtro

source: Past Practice Logs
pt: Log de treinos passados

source: Duration:
pt: Duração

source: Players:
pt: Jogadores:

source: Exercises:
pt: Exercícios

source: Notes:
pt: Notas

source: Delete this register entry?
pt: Apagar este treino

source: Sign Up – Team Manager
pt: Criar conta - Gestão de Equipas

source: Create Your Account
pt: Crie a sua conta

source: Username
pt: Nome de utilizador

source: Already have an account? Log in
pt: Já tem uma conta? Entrar

source: Player Matrix
pt: Matrix jogador

source: Date:
pt: Data:

source: Place:
pt: Local:

source: Coach Notes:
pt: Notas:

source: Save Matrix
pt: Salvar Matrix

source: Player Minutes Summary
pt: Sumário minutos por jogador

source: Tournaments – Team Manager
pt: Encontros - Gestão de Equipas

source: Add Tournament
pt: Adicionar Encontros

source: Create Tournament
pt: Criar Encontros

source: Saved Tournaments
pt: Salvar Encontros

source: Opponents:
pt: Adversários

source: Delete this tournament?
pt: Apagar este Encontro?
